In [2]:
import pandas as pd
data1 = {"emp id":["E01","E02","E03","E04","E05"],
        "name":["john","shyam","rahul","visahl","ravi"],
        "age":[20,22,36,44,56]}
data2 = {"emp id":["E01","E02","E03","E04","E05"],
        "Salary":[15000,20000,55000,30000,12000]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
print(df1)
print()
print(df2)

  emp id    name  age
0    E01    john   20
1    E02   shyam   22
2    E03   rahul   36
3    E04  visahl   44
4    E05    ravi   56

  emp id  Salary
0    E01   15000
1    E02   20000
2    E03   55000
3    E04   30000
4    E05   12000

C:\Users\SACHI\AppData\Local\Temp\ipykernel_5880\2115223086.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [3]:
print(pd.merge(df1,df2,on = "emp id"))

  emp id    name  age  Salary
0    E01    john   20   15000
1    E02   shyam   22   20000
2    E03   rahul   36   55000
3    E04  visahl   44   30000
4    E05    ravi   56   12000

In [4]:
data3 = {"emp id":["E01","E06","E03","E08","E04","E09"],
        "name":["john","shyam","rahul","visahl","ravi","mohan"],
        "age":[20,22,36,44,56,23]}
data4 = {"emp id":["E01","E02","E03","E04","E07","E11"],
       "Salary":[15000,20000,55000,30000,12000,21000]}
df1 = pd.DataFrame(data3)
df2 = pd.DataFrame(data4)
print(df1)
print()
print(df2)

  emp id    name  age
0    E01    john   20
1    E06   shyam   22
2    E03   rahul   36
3    E08  visahl   44
4    E04    ravi   56
5    E09   mohan   23

  emp id  Salary
0    E01   15000
1    E02   20000
2    E03   55000
3    E04   30000
4    E07   12000
5    E11   21000

In [5]:
print(pd.merge(left = df1,right =df2,on = "emp id",how = "left"))

  emp id    name  age   Salary
0    E01    john   20  15000.0
1    E06   shyam   22      NaN
2    E03   rahul   36  55000.0
3    E08  visahl   44      NaN
4    E04    ravi   56  30000.0
5    E09   mohan   23      NaN

In [6]:
print(pd.merge(left = df1,right =df2,on = "emp id",how = "right"))

  emp id   name   age  Salary
0    E01   john  20.0   15000
1    E02    NaN   NaN   20000
2    E03  rahul  36.0   55000
3    E04   ravi  56.0   30000
4    E07    NaN   NaN   12000
5    E11    NaN   NaN   21000

In [14]:
import pandas as pd
data1 = {"emp id":["E01","E02","E03","E04","E05"],
        "name":["john","shyam","rahul","visahl","ravi"],
        "age":[20,22,36,44,56]}
data2 = {"emp id":["E06","E07","E08","E09","E10"],
          "name":["papu","chotu","piyush","siya","ram"],
        "age":[21,25,26,14,16]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
print(df1)
print()

print(df2)

  emp id    name  age
0    E01    john   20
1    E02   shyam   22
2    E03   rahul   36
3    E04  visahl   44
4    E05    ravi   56

  emp id    name  age
0    E06    papu   21
1    E07   chotu   25
2    E08  piyush   26
3    E09    siya   14
4    E10     ram   16

In [16]:
print(pd.concat([df1,df2]))

  emp id    name  age
0    E01    john   20
1    E02   shyam   22
2    E03   rahul   36
3    E04  visahl   44
4    E05    ravi   56
0    E06    papu   21
1    E07   chotu   25
2    E08  piyush   26
3    E09    siya   14
4    E10     ram   16